{
  "document_title": "คำอธิบายรายวิชา",
  "course_details": {
    "academic_year": "2568",
    "semester": "1",
    "learning_area": "ภาษาต่างประเทศ",
    "course_type": "พื้นฐาน",
    "course_code": "อ15101",
    "course_name": "ภาษาอังกฤษ 5"
  },
  "course_description": {
    "details": "ปฏิบัติตามคำสั่งง่ายๆ และคำขอร้องง่ายๆ ที่ฟัง ระบุตัวอักษรและเสียง อ่านออกเสียงคำ สะกดคำ และอ่านประโยคง่ายๆ ถูกต้องตามหลักการอ่าน เลือกภาพตรงตามความหมายของคำและกลุ่มคำที่ฟัง ตอบคำถามจากการฟังประโยค บทสนทนาหรือนิทานง่าย ๆ ที่มีภาพประกอบ พูดโต้ตอบด้วยคำสั้นๆ ง่าย ๆในการสื่อสารระหว่างบุคคลตามแบบที่ฟัง ใช้คำสั่งและคำขอร้องง่าย ๆ ตามแบบที่ฟัง บอกความต้องการง่ายๆของตนเองตามแบบที่ฟัง พูดขอและให้ข้อมูลง่ายๆ เกี่ยวกับตนเองตามแบบที่ฟัง พูดให้ข้อมูล เกี่ยวกับตนเองและเรื่องใกล้ตัว พูดและทำท่าทางประกอบตามวัฒนธรรมของเจ้าของภาษา บอกชื่อและคำศัพท์เกี่ยวกับเทศกาลสำคัญของเจ้าของภาษา การเข้าร่วมกิจกรรมทางภาษาและวัฒนธรรมที่เหมาะสมกับวัย ระบุตัวอักษรและเสียงอักษรของภาษาต่างประเทศ(ภาษาอังกฤษ)และภาษาไทย บอกคำศัพท์ที่เกี่ยวข้องกับกลุ่มสาระการเรียนรู้อื่น ฟัง/พูดในสถานการณ์ง่ายๆที่เกิดขึ้นในห้องเรียน ใช้ภาษาต่างประเทศ(ภาษาอังกฤษ)เพื่อรวบรวมคำศัพท์ที่เกี่ยวข้องใกล้ตัว โดยการระบุ อ่านออกเสียง เลือก ตอบคำถาม พูดโต้ตอบ ใช้ บอก ทำท่าทาง เข้าร่วม ฟัง เพื่อให้ผู้เรียนมีความรู้ความเข้าใจและนำไปประยุกต์ใช้ในชีวิตประจำวัน เกิดสมรรถนะตามความต้องการของหลักสูตร มีคุณลักษณะอันพึงประสงค์ขึ้นในตัวของผู้เรียน และสามารถอยู่ร่วมกับผู้อื่นในสังคมได้อย่างมีความสุข สามารถนำความรู้ไปใช้ให้เกิดประโยชน์โดยใช้หลักปรัชญาของเศรษฐกิจพอเพียงและสามารถนำไปประยุกต์ใช้กับชีวิตประจำวันได้อย่างถูกต้องเหมาะสม"
  },
  "indicators_summary": {
    "total": 25,
    "breakdown": [
      {
        "type": "ระหว่างทาง",
        "count": 17
      },
      {
        "type": "ปลายทาง",
        "count": 8
      }
    ]
  },
  "indicator_details": {
    "mid_term": [
      "ต.1.1 ป.1/1",
      "ต.1.1 ป.1/2",
      "ต.1.1 ป.1/3",
      "ต.1.1 ป.1/4",
      "ต.1.1 ป.1/5",
      "ต.1.1 ป.1/6",
      "ต.1.1 ป.1/7"
    ],
    "final_term": [
      "ต.1.1 ป.1/1",
      "ต.1.1 ป.1/2",
      "ต.1.1 ป.1/3",
      "ต.1.1 ป.1/4",
      "ต.1.1 ป.1/5",
      "ต.1.1 ป.1/6",
      "ต.1.1 ป.1/7"
    ]
  }
}
